In [18]:
import numpy as np
import pandas as pd
from scipy import stats

In [2]:
titanic_data = pd.read_csv("https://raw.githubusercontent.com/dphi-official/First_ML_Model/master/titanic.csv", index_col = 'PassengerId')

In [12]:
titanic_data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [14]:
titanic_data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [15]:
titanic_data['Fare'].isnull().sum()

0

In [19]:
stats.mode(titanic_data['SibSp'])

ModeResult(mode=array([0], dtype=int64), count=array([608]))

In [27]:
titanic_data[titanic_data['Survived']== 1].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 342 entries, 2 to 890
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  342 non-null    int64
 1   Pclass    342 non-null    int64
 2   Name      342 non-null    object
 3   Sex       342 non-null    object
 4   Age       290 non-null    float64
 5   SibSp     342 non-null    int64
 6   Parch     342 non-null    int64
 7   Ticket    342 non-null    object
 8   Fare      342 non-null    float64
 9   Cabin     136 non-null    object
 10  Embarked  340 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 32.1+ KB

In [31]:
round(342/891, 2)

0.38

In [32]:
round(np.median(titanic_data['Fare']), 4)

14.4542

In [33]:
print('% of men who survived', 100*np.mean(titanic_data['Survived'][titanic_data['Sex'] == 'male']))
print('% of women who survived', 100*np.mean(titanic_data['Survived'][titanic_data['Sex'] == 'female']))

% of men who survived 18.890814558058924
% of women who survived 74.20382165605095

In [34]:
print('% of children who survived', 100*np.mean(titanic_data['Survived'][titanic_data['Age'] < 18]))
print('% of adults who survived', 100*np.mean(titanic_data['Survived'][titanic_data['Age'] > 18]))

% of children who survived 53.98230088495575
% of adults who survived 38.26086956521739

In [36]:
survived_passengers = titanic_data[titanic_data['Survived']== 1]
survived_passengers.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 342 entries, 2 to 890
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  342 non-null    int64
 1   Pclass    342 non-null    int64
 2   Name      342 non-null    object
 3   Sex       342 non-null    object
 4   Age       290 non-null    float64
 5   SibSp     342 non-null    int64
 6   Parch     342 non-null    int64
 7   Ticket    342 non-null    object
 8   Fare      342 non-null    float64
 9   Cabin     136 non-null    object
 10  Embarked  340 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 32.1+ KB

In [37]:
survived_passengers[survived_passengers['Embarked']=='S'].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 217 entries, 3 to 888
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  217 non-null    int64
 1   Pclass    217 non-null    int64
 2   Name      217 non-null    object
 3   Sex       217 non-null    object
 4   Age       201 non-null    float64
 5   SibSp     217 non-null    int64
 6   Parch     217 non-null    int64
 7   Ticket    217 non-null    object
 8   Fare      217 non-null    float64
 9   Cabin     80 non-null     object
 10  Embarked  217 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 20.3+ KB

In [41]:
titanic_data['Fare'].sort_values(ascending=False).head(5)

PassengerId
680    512.3292
259    512.3292
738    512.3292
342    263.0000
439    263.0000
Name: Fare, dtype: float64

In [44]:
titanic_data['Age'].isnull().sum()

177

In [47]:
ages = titanic_data['Age'].dropna()
np.median(ages)

28.0

In [50]:
len(titanic_data.Name.unique())

891